; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=97, remove_proportion=0.101, bases=38, instance_id=30, output=./training, seed=71

(define (problem warehouse-30)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 box39 box40 box41 box42 box43 box44 box45 box46 box47 box48 box49 box50 box51 box52 box53 box54 box55 box56 box57 box58 box59 box60 box61 box62 box63 box64 box65 box66 box67 box68 box69 box70 box71 box72 box73 box74 box75 box76 box77 box78 box79 box80 box81 box82 box83 box84 box85 box86 box87 box88 box89 box90 box91 box92 box93 box94 box95 box96 box97 - box
        base1 base2 base3 base4 base5 base6 base7 base8 base9 base10 base11 base12 base13 base14 base15 base16 base17 base18 base19 base20 base21 base22 base23 base24 base25 base26 base27 base28 base29 base30 base31 base32 base33 base34 base35 base36 base37 base38 - base
    )
    (:init
        (to-remove box2)
        (to-remove box12)
        (to-remove box20)
        (to-remove box26)
        (to-remove box34)
        (to-remove box42)
        (to-remove box66)
        (to-remove box80)
        (to-remove box97)
        (clear box96)
        (on-base box96 base1)
        (clear box6)
        (on box6 box64)
        (on box64 box38)
        (on box38 box24)
        (on box24 box33)
        (on box33 box15)
        (on-base box15 base2)
        (clear box65)
        (on box65 box13)
        (on-base box13 base3)
        (clear box76)
        (on box76 box3)
        (on-base box3 base4)
        (clear box39)
        (on-base box39 base5)
        (clear box82)
        (on-base box82 base6)
        (clear box42)
        (on box42 box40)
        (on box40 box23)
        (on box23 box62)
        (on box62 box51)
        (on-base box51 base7)
        (clear-base base8)
        (clear box81)
        (on box81 box44)
        (on box44 box10)
        (on-base box10 base9)
        (clear box19)
        (on box19 box27)
        (on box27 box75)
        (on box75 box26)
        (on-base box26 base10)
        (clear box12)
        (on box12 box55)
        (on-base box55 base11)
        (clear-base base12)
        (clear box66)
        (on box66 box18)
        (on box18 box4)
        (on box4 box1)
        (on-base box1 base13)
        (clear box83)
        (on box83 box52)
        (on box52 box54)
        (on box54 box36)
        (on-base box36 base14)
        (clear box67)
        (on-base box67 base15)
        (clear box28)
        (on box28 box25)
        (on box25 box73)
        (on box73 box80)
        (on box80 box41)
        (on-base box41 base16)
        (clear box34)
        (on box34 box88)
        (on box88 box61)
        (on box61 box63)
        (on-base box63 base17)
        (clear box74)
        (on box74 box85)
        (on-base box85 base18)
        (clear box43)
        (on box43 box50)
        (on-base box50 base19)
        (clear box53)
        (on box53 box31)
        (on box31 box89)
        (on box89 box72)
        (on-base box72 base20)
        (clear box20)
        (on box20 box60)
        (on box60 box69)
        (on box69 box92)
        (on-base box92 base21)
        (clear-base base22)
        (clear box35)
        (on box35 box49)
        (on box49 box14)
        (on box14 box30)
        (on box30 box11)
        (on-base box11 base23)
        (clear box8)
        (on-base box8 base24)
        (clear box16)
        (on box16 box90)
        (on-base box90 base25)
        (clear box37)
        (on-base box37 base26)
        (clear box45)
        (on box45 box97)
        (on-base box97 base27)
        (clear box21)
        (on box21 box87)
        (on-base box87 base28)
        (clear box84)
        (on box84 box57)
        (on box57 box22)
        (on-base box22 base29)
        (clear box9)
        (on box9 box79)
        (on box79 box86)
        (on-base box86 base30)
        (clear box68)
        (on box68 box46)
        (on box46 box58)
        (on-base box58 base31)
        (clear box95)
        (on box95 box93)
        (on box93 box47)
        (on box47 box77)
        (on-base box77 base32)
        (clear box5)
        (on box5 box29)
        (on box29 box2)
        (on box2 box70)
        (on box70 box71)
        (on-base box71 base33)
        (clear box7)
        (on-base box7 base34)
        (clear box78)
        (on box78 box59)
        (on box59 box91)
        (on-base box91 base35)
        (clear box94)
        (on-base box94 base36)
        (clear box56)
        (on box56 box48)
        (on-base box48 base37)
        (clear box17)
        (on box17 box32)
        (on-base box32 base38)
    )
    (:goal (and 
        (removed box2)
        (removed box12)
        (removed box20)
        (removed box26)
        (removed box34)
        (removed box42)
        (removed box66)
        (removed box80)
        (removed box97)
    ))
)

; plan
1. (remove box12 box55)
   deleted: (on box12 box55) (clear box12)
   added: (removed box12) (clear box55)
   goals met: 1 of 9
2. (move box19 box27 box16)
   deleted: (clear box16) (on box19 box27)
   added: (on box19 box16) (clear box27)
   goals met: 1 of 9
3. (move box27 box75 box17)
   deleted: (clear box17) (on box27 box75)
   added: (on box27 box17) (clear box75)
   goals met: 1 of 9
4. (move box28 box25 box19)
   deleted: (clear box19) (on box28 box25)
   added: (on box28 box19) (clear box25)
   goals met: 1 of 9
5. (remove box20 box60)
   deleted: (on box20 box60) (clear box20)
   added: (removed box20) (clear box60)
   goals met: 2 of 9
6. (move box25 box73 box21)
   deleted: (clear box21) (on box25 box73)
   added: (on box25 box21) (clear box73)
   goals met: 2 of 9
7. (move box45 box97 box25)
   deleted: (clear box25) (on box45 box97)
   added: (on box45 box25) (clear box97)
   goals met: 2 of 9
8. (move box5 box29 box27)
   deleted: (clear box27) (on box5 box29)
   added: (on box5 box27) (clear box29)
   goals met: 2 of 9
9. (move box29 box2 box28)
   deleted: (clear box28) (on box29 box2)
   added: (on box29 box28) (clear box2)
   goals met: 2 of 9
10. (remove box2 box70)
   deleted: (on box2 box70) (clear box2)
   added: (removed box2) (clear box70)
   goals met: 3 of 9
11. (move box73 box80 box29)
   deleted: (clear box29) (on box73 box80)
   added: (on box73 box29) (clear box80)
   goals met: 3 of 9
12. (remove box34 box88)
   deleted: (on box34 box88) (clear box34)
   added: (removed box34) (clear box88)
   goals met: 4 of 9
13. (move box75 box26 box35)
   deleted: (clear box35) (on box75 box26)
   added: (on box75 box35) (clear box26)
   goals met: 4 of 9
14. (remove-from-base box26 base10)
   deleted: (on-base box26 base10) (clear box26)
   added: (removed box26) (clear-base base10)
   goals met: 5 of 9
15. (remove box42 box40)
   deleted: (on box42 box40) (clear box42)
   added: (removed box42) (clear box40)
   goals met: 6 of 9
16. (remove box66 box18)
   deleted: (on box66 box18) (clear box66)
   added: (removed box66) (clear box18)
   goals met: 7 of 9
17. (remove box80 box41)
   deleted: (on box80 box41) (clear box80)
   added: (removed box80) (clear box41)
   goals met: 8 of 9
18. (remove-from-base box97 base27)
   deleted: (on-base box97 base27) (clear box97)
   added: (removed box97) (clear-base base27)
   goals met: 9 of 9
